       01 REG-AL-APROV.
           03 ID-INC-APROV                        PIC 9(03).
           03 NM-ALUNO                            PIC X(20).
           03 NM-DISCIPLINA                       PIC X(20).
           03 MD-NOTA                             PIC 9(02)V99.
           03 ST-ALUNO                            PIC X(10).
