       01 REG-ALUNO.
           03 ID-ALUNO                    PIC 9(03).
           03 NM-ALUNO                    PIC X(20).
           03 TL-ALUNO                    PIC X(20).
           