       01 REG-DISCIPLINA.
           03 ID-DISCIPLINA                   PIC 9(03).
           03 NM-DISCIPLINA                   PIC X(20).
           03 NT-DISCIPLINA                    PIC 9(02)V99.
